{
    "resourceType" : "OperationDefinition",
    "id" : "cql-library-evaluate",
    "extension" : [{
        "url" : "http://hl7.org/fhir/StructureDefinition/structuredefinition-fmm",
        "valueInteger" : 3
      },
      {
        "url" : "http://hl7.org/fhir/StructureDefinition/structuredefinition-wg",
        "valueCode" : "cds"
      },
      {
        "url" : "http://hl7.org/fhir/StructureDefinition/structuredefinition-standards-status",
        "valueCode" : "trial-use"
      }],
    "url" : "http://hl7.org/fhir/uv/cql/OperationDefinition/cql-library-evaluate",
    "name" : "CQLLibraryEvaluate",
    "title" : "CQL Library Evaluate",
    "status" : "active",
    "kind" : "operation",
    "experimental" : false,
    "date" : "2023-11-27T16:26:11+00:00",
    "publisher" : "HL7 International / Clinical Decision Support",
    "contact" : [{
      "name" : "HL7 International / Clinical Decision Support",
      "telecom" : [{
        "system" : "url",
        "value" : "http://www.hl7.org/Special/committees/dss"
      }]
    }],
    "description" : "Evaluates the contents of a library and returns the results as a Parameters resource.",
    "jurisdiction" : [{
      "coding" : [{
        "system" : "http://unstats.un.org/unsd/methods/m49/m49.htm",
        "code" : "001",
        "display" : "World"
      }]
    }],
    "purpose" : "This operation is defined to support evaluating the contents of a library directly via an operation",
    "affectsState" : false,
    "code" : "evaluate",
    "resource" : ["Library"],
    "system" : false,
    "type" : true,
    "instance" : true,
    "parameter" : [{
      "name" : "library",
      "use" : "in",
      "min" : 0,
      "max" : "1",
      "documentation" : "The canonical url (with optional version) of the library to be evaluated. This parameter is only used when the operation is invoked at the type level.",
      "type" : "canonical"
    },
    {
      "name" : "subject",
      "use" : "in",
      "min" : 0,
      "max" : "1",
      "documentation" : "Subject for which the library will be evaluated. This corresponds to the context in which the library will be evaluated and is represented as a relative FHIR id (e.g. Patient/123), which establishes both the context and context value for the evaluation",
      "type" : "string",
      "searchType" : "reference"
    },
    {
      "name" : "expression",
      "use" : "in",
      "min" : 0,
      "max" : "*",
      "documentation" : "Expression(s) to be evaluated. If no expression names are provided, the operation evaluates all public expression definitions in the library.",
      "type" : "string"
    },
    {
      "name" : "parameters",
      "use" : "in",
      "min" : 0,
      "max" : "1",
      "documentation" : "Any input parameters for the library. Parameters defined in this input will be bound by name to parameters defined in the CQL library (or referenced libraries). Parameter types are mapped to CQL as specified in the Using CQL section of this implementation guide. If a parameter appears more than once in the input Parameters resource, it is represented with a List in the input CQL. If a parameter has parts, it is represented as a Tuple in the input CQL.",
      "type" : "Parameters"
    },
    {
      "name" : "useServerData",
      "use" : "in",
      "min" : 0,
      "max" : "1",
      "documentation" : "Whether to use data from the server performing the evaluation. If this parameter is true (the default), then the operation will use data first from any bundles provided as parameters (through the data and prefetch parameters), second data from the server performing the operation, and third, data from the dataEndpoint parameter (if provided). If this parameter is false, the operation will use data first from the bundles provided in the data or prefetch parameters, and second from the dataEndpoint parameter (if provided).",
      "type" : "boolean"
    },
    {
      "name" : "data",
      "use" : "in",
      "min" : 0,
      "max" : "1",
      "documentation" : "Data to be made available to the library evaluation. This parameter is exclusive with the prefetchData parameter (i.e. either provide all data as a single bundle, or provide data using multiple bundles with prefetch descriptions).",
      "type" : "Bundle"
    },
    {
      "name" : "prefetchData",
      "use" : "in",
      "min" : 0,
      "max" : "*",
      "documentation" : "Data to be made available to the library evaluation, organized as prefetch response bundles. Each prefetchData parameter specifies either the name of the prefetchKey it is satisfying, a DataRequirement describing the prefetch, or both.",
      "part" : [{
        "name" : "key",
        "use" : "in",
        "min" : 0,
        "max" : "1",
        "documentation" : "The key of the prefetch item. When using this operation as part of a CDS Hooks implementation, this SHALL be the name of a prefetch item in a CDS Hooks discovery response. Prefetch data SHALL be made available to retrieve statements in the CQL and SHOULD NOT be provided as the value of any CQL parameters in the library being evaluated to avoid confusion between context parameters and retrieve data.",
        "type" : "string"
      },
      {
        "name" : "descriptor",
        "use" : "in",
        "min" : 0,
        "max" : "1",
        "documentation" : "A DataRequirement describing the content of the prefetch item.",
        "type" : "DataRequirement"
      },
      {
        "name" : "data",
        "use" : "in",
        "min" : 0,
        "max" : "1",
        "documentation" : "The prefetch data as a Bundle. If this part is missing, it indicates there is no data associated with this prefetch item.",
        "type" : "Bundle"
      }]
    },
    {
      "name" : "dataEndpoint",
      "use" : "in",
      "min" : 0,
      "max" : "1",
      "documentation" : "An endpoint to use to access data referenced by retrieve operations in the library. If provided, this endpoint is used after the data or prefetchData bundles, and the server, if the useServerData parameter is true.",
      "type" : "Endpoint"
    },
    {
      "name" : "contentEndpoint",
      "use" : "in",
      "min" : 0,
      "max" : "1",
      "documentation" : "An endpoint to use to access content (i.e. libraries) referenced by the library. If no content endpoint is supplied, the evaluation will attempt to retrieve content from the server on which the operation is being performed.",
      "type" : "Endpoint"
    },
    {
      "name" : "terminologyEndpoint",
      "use" : "in",
      "min" : 0,
      "max" : "1",
      "documentation" : "An endpoint to use to access terminology (i.e. valuesets, codesystems, and membership testing) referenced by the library. If no terminology endpoint is supplied, the evaluation will attempt to use the server on which the operation is being performed as the terminology server.",
      "type" : "Endpoint"
    },
    {
      "name" : "return",
      "use" : "out",
      "min" : 1,
      "max" : "1",
      "documentation" : "The results of the library evaluation, returned as a Parameters resource with a parameter for each named expression requested by the expression input parameter (or all public expressions defined in the library if no expression input parameter was specified). Note that explicit request for evaluation of an expression does not respect the access modifier (i.e. even private expressions can be evaluated by directly requesting evaluation of the expression by name).",
      "type" : "Parameters"
    }]
  }
